In [1]:
import numpy as np
import pandas as pd

In [4]:
cars_data = pd.read_csv('cars.csv')
cars_data.head()

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JPN           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True

In [5]:
cars_data.columns

Index(['Unnamed: 0', 'cars_per_cap', 'country', 'drives_right'], dtype='object')

In [12]:
rename = {'Unnamed: 0' : 'country_code'}
cars_data.rename(columns = rename , inplace = True)
cars_data.head()

  country code  cars_per_cap        country  drives_right
0           US           809  United States          True
1          AUS           731      Australia         False
2          JPN           588          Japan         False
3           IN            18          India         False
4           RU           200         Russia          True

In [19]:
index = 
index

country code
US      US
AUS    AUS
JPN    JPN
IN      IN
RU      RU
MOR    MOR
EG      EG
Name: country code, dtype: object

In [21]:
cars_data.index = ['US','AUS','JPN','IN','RU','MOR','EG']
cars_data.head()

    country code  cars_per_cap        country  drives_right
US            US           809  United States          True
AUS          AUS           731      Australia         False
JPN          JPN           588          Japan         False
IN            IN            18          India         False
RU            RU           200         Russia          True

In [37]:
cars_data.loc['US','cars_per_cap'] 
#slicing using loc function
#it takes column name and Index nam as argument

809

In [38]:
cars_data.iloc[0,1] 
#slicing using iloc function
#it takes indexing as argument

809

In [34]:
cars_data.loc['AUS',:] # specific row with all coulmns

country code          AUS
cars_per_cap          731
country         Australia
drives_right        False
Name: AUS, dtype: object

In [35]:
cars_data.loc["JPN"] #specific row

country code      JPN
cars_per_cap      588
country         Japan
drives_right    False
Name: JPN, dtype: object

In [39]:
cars_data.iloc[:,2] #specific column with all rows

US     United States
AUS        Australia
JPN            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object